johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
/*
  ESP32: WP CTA Aeroheat CI 8is Prod Home Assistant Integration (MQTT)
*/

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
#include <Arduino.h>
#include <ESP32.h>
#include <Preferences.h>

#include <Chrono.h>
#include <WiFi.h>
#include <Time.h>
#include <esp_sntp.h>
#include <UnixTime.h>

#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <WebSerialPro.h>

#include <MQTT.h>

#include "ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.h"

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
#define SERIAL_BAUDRATE 115200      // serial interface bauderate
#define SERIAL_DELAY 200            // serial communication delay [ms]
#define SERIAL_RX_BUFFER_SIZE 2048  // serial RX buffer size [byte]
#define SERIAL_TX_BUFFER_SIZE 2048  // serial TX buffer size [byte]

#define CONNECTION_DELAY 1000            // WiFi / MQTT connection delay [ms]
#define CONNECTION_RETRY_DELAY 1000      // WiFi / MQTT retry connection delay [ms]
#define CONNECTION_DISCONNECT_DELAY 500  // WiFi / MQTT disconnection delay [ms]

#define TCP_COMMUNICATION_DELAY 1000  // WP TCP communication delay [ms]
#define TCP_DISCONNECT_DELAY 500      // WP TCP disconnection delay [ms]
#define TCP_RX_DELAY 50               // WP TCP receive delay [ms]
#define TCP_TX_DELAY 50               // WP TCP transmit delay [ms]

#define MQTT_LOOP_DELAY 10       // MQTT loop communication delay [ms]
#define MQTT_SUBSCRIBE_DELAY 10  // MQTT subscribe communication delay [ms]
#define MQTT_PUBLISH_DELAY 10    // MQTT publish communication delay [ms]

#define MQTT_IO_BUFFER_SIZE 512  // MQTT I/O buffer size [byte]

#define WP_DATA_HANDLE_INTERVAL_CHRONO 10  // chrono wp data handle interval [s]

#define STATE_OUTPUT_REFRESH_INTERVAL_CHRONO 10  // chrono wp + converter states output refresh interval [s]

#define WP_STATE_OFFLINE_CHANGE_LIMIT 5  // wp state "Offline" change limit
#define WP_STATE_OFFLINE_STAGE_LIMIT 10  // wp state "Offline" stage limit

#define DEBUG_OUTPUT  // default serial interface output active

#define OTA_OUTPUT  // over the air serial monitor output active

#define ESP32_RESTART_TIME "06:00"      // ESP32 restart time 06h00
#define ESP32_RESTART_LOCK_DELAY 60000  // ESP32 restart lock delay 60s [ms]
#define ESP32_RESTART_DELAY 5000        // ESP32 restart command delay [ms]
#define ESP32_HALT_DELAY 60000          // ESP32 halt delay 60s [ms]

#define WP_SYSTEM_TIME_ADJUST 0         // enable/disable wp system time adjustment
#define BASE_UNIX_TIMESTAMP 1704106800  // 2024-01-01 12:00:00 PM
#define NTP_WP_TIMESTAMP_DIFF 10        // max. SNTP/WP Timestamp Difference [s]
#define GMT 0                           // Greenwich Mean Time
#define GMT_CET 1                       // (+1 GMT)
#define GMT_CEST 2                      // (+1 GMT / +1h summertime offset)

#define WEB_SERIAL_MAX_OUTPUT_COUNT 10    // max. web serial output count
#define WEB_SERIAL_MAX_OUTPUT_DELAY 1000  // web serial output delay [ms] 

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
// instantiate preferences library
Preferences nvs;  // non-volatile storage (NVS)

// instantiate chrono objects
Chrono wpDataHandleChrono(Chrono::SECONDS);
Chrono refreshOutputStateChrono(Chrono::SECONDS);

// instantiate WiFi+SNTP+MQTT objects
WiFiClient wifiConnectionID;
MQTTClient mqttClient(MQTT_IO_BUFFER_SIZE);

// instantiate over the air serial monitor
#ifdef OTA_OUTPUT
  AsyncWebServer serialOTA(80);
#endif

// structure definition include <Time.h>
struct tm timeInfo;

// instantiate unix time object
UnixTime wpUnixTime(GMT);

// WiFi definitions
const char wifiSSID[] = "WLAN_Belp";  // WiFi network SSID
const char wifiPassword[] = "family.ruch@belp";  // WiFi network password

// SNTP definitions
const char *timeZone = "CET-1CEST,M3.5.0,M10.5.0/3";  // Time Zone rule for Europe/Rome including daylight adjustment rules (optional)
const char *sntpTimeServer1 = "ch.pool.ntp.org";
const char *sntpTimeServer2 = "pool.ntp.org";
const char *sntpServername = sntpTimeServer1;
u8_t sntpServerID = 0;
uint32_t sntpUnixTimestamp = 0;
uint32_t wpUnixTimestamp = 0;
uint32_t wpUnixTimestampDiff = 0;
uint16_t timeZoneAdjustment = GMT_CET;
const uint32_t gmtOffset = 3600;        // GMT+1 [s]
const uint16_t daylightOffset = 3600;  // 1h [s]
char *sntpDateTime = "1970-01-01 / 00:00:00";
char *wpDateTime = "1970-01-01 / 00:00:00";
char *sntpTimestamp = "00:00";
String sntpTimeZone = "CET";  // "CET" or "CEST"

// CTA Aeroheat CI 8is Prod definitions
const char wpServerIP[] = "192.168.1.190";
int wpServerPort = 8889;
//const char wpUser[] = "";
//const char wpPassword[] = "999999";
const char wpClientID[] = "wp";

// MQTT definitions
const char mqttServer[] = "192.168.1.150";
int mqttServerPort = 1883;
const char mqttUser[] = "mqtt-admin";
const char mqttPassword[] = "mqtt-admin";
const char mqttClientID[] = "wp_mqtt_prod";
bool mqttSuccess;
bool mqttDisconnectSkip = false;

String mqttTopic;
String mqttTopicID;
String mqttTopicEntity;
String mqttPayload;
unsigned long mqttPayloadData;
unsigned int mqttPayloadInt;
float mqttPayloadFloat;
bool mqttRetained = false;
const unsigned int mqttQoS = 0;

unsigned long tcpTxCounter;
unsigned long tcpRxCounter;

uint16_t wpRegisterBlockHeadElement;
uint16_t wpRegisterBlockElements;
uint16_t wpEntityRegisterAddress;
char *wpEntityDescriptor;
char *wpEntityDataType;
float wpEntityDataFactor;
char *wpEntityUnit;
bool wpEntityActiveMQTT;
uint16_t wpStateID = WP_STATE_OFFLINE;
char *wpState = "Offline";
uint16_t wpShutdownReasonID;
char *wpShutdownReason[5];

// communication definitions
unsigned int wpReconnectionCounter = 0;
const unsigned int wpMaxReconnections = 10;

unsigned int mqttReconnectionCounter = 0;
const unsigned int mqttMaxReconnections = 10;

const unsigned int tcpRxPacketSize = 4;  // tcp receive packet size
const unsigned int tcpRxBufferSize = 2048;
uint8_t tcpRxBuffer[tcpRxBufferSize] = {0};  // wp tcp receive buffer
const unsigned int tcpTxPacketSize = 4;  // tcp transmit packet size
const unsigned int tcpTxBufferSize = 4;

unsigned int wpRxRequestedByteNumber = WP_REGISTER_VALUES_NUMBER_BYTES;
unsigned int tcpRxByteAvailable;
unsigned int tcpRxByteReceived;

uint16_t wpTCPCommandGetParameter = 3004;
uint8_t wpTCPCommandGetParameterSequence[tcpTxBufferSize] = {0x00, 0x00, 0x0b, 0x0bc};  // '3004'
uint16_t wpTCPCommandSetParameter = 3002;
uint8_t wpTCPCommandSetParameterSequence[tcpTxBufferSize] = {0x00, 0x00, 0x0b, 0x0ba};  // '3002'
uint16_t wpTCPCommandExecute = 0;
uint8_t wpTCPCommandExecuteSequence[tcpTxBufferSize] = {0x00, 0x00, 0x00, 0x00};  // '0000'
uint8_t wpTCPSetParameterSystemTimeSequence[tcpTxBufferSize] = {0x00, 0x00, 0x00, 0x89};  // '137'
uint8_t wpTCPSetParameterValueSequence[tcpTxBufferSize];
unsigned long tcpCheckGetValue = 0;
unsigned long tcpCheckExecute = 0;
unsigned long tcpCheckParameters = 0;

bool esp32Halt = 0;
bool connectionsEstablished = 0;
bool wpCommandTransmitted = 0;

