johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
// common definitions
char msgString[256];  // message char array

String wpRegisterBlockName;
unsigned int wpRegisterBlockIndex = 0;
unsigned int systenTimeBlockIndex = 0;
unsigned int tcpBufferIndex;

unsigned long wpDataHandleCounter = 0;

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void setup() {
  // initialize chronos
  wpDataHandleChrono.stop();
  refreshOutputStateChrono.stop();
  
  // initialize default serial interface
  Serial.setRxBufferSize(SERIAL_RX_BUFFER_SIZE);
  Serial.setTxBufferSize(SERIAL_TX_BUFFER_SIZE);
  Serial.begin(SERIAL_BAUDRATE);
  delay(SERIAL_DELAY);
  Serial.flush();
  
  // initialize NVS (R+W)
  nvs.begin("CTA_NVS", false);
  
  // read persisted NVS values
  for(uint8_t i = 0; i < ESP32_RESTART_INFO_ELEMENTS; i++) {
    esp32RestartInfo[i].esp32RestartCounter = nvs.getUInt(esp32RestartInfo[i].esp32RestartReasonNVS, esp32RestartInfo[i].esp32RestartCounter);
  }
  
  // output infoline
  Serial.println("CTA Aeroheat CI 8is Prod [Init WiFi + MQTT]");
  Serial.println();
  
  // initialize WiFi network connection
  Serial.print("WiFi connecting...");
  WiFi.mode(WIFI_STA);  // WiFi station mode
  WiFi.begin(wifiSSID, wifiPassword);
  delay(CONNECTION_DELAY);
  while(WiFi.waitForConnectResult() != WL_CONNECTED) {
    WiFi.disconnect();
    sprintf(msgString, "\nWiFi Error: WiFi not connected!");
    Serial.println(msgString);
    
    esp32Restart(ESP32_RESTART_WIFI_CONNECTION);
  }
  Serial.print("\nWiFi <");
  Serial.print(wifiSSID);
  Serial.print("> / <");
  Serial.print(WiFi.localIP());
  Serial.println("> connected.\n");
  Serial.println();
  
  // initialize SNTP
  esp_sntp_init();
  esp_sntp_setservername(sntpServerID, sntpTimeServer1);
  configTime(gmtOffset, daylightOffset, sntpTimeServer1, sntpTimeServer2);
  configTzTime(timeZone, sntpTimeServer1, sntpTimeServer2);
  Serial.println("SNTP initialized...\n");
	
  // initialize over the air serial monitor
  #ifdef OTA_OUTPUT
    WebSerial.begin(&serialOTA);
    WebSerial.onMessage(serialOTAReceiver);
    serialOTA.begin();
    WebSerial.setID("WP Prod Home Assistant Integration");
  #endif
  
  // WP server connection only used in loop()
  
  // initialize MQTT server connection
  Serial.print("MQTT server <");
  Serial.print(mqttServer);
  Serial.print("> connecting...");
  mqttClient.begin(mqttServer, mqttServerPort, wifiConnectionID);
  delay(CONNECTION_DELAY);
  mqttReconnectionCounter = 0;
  while(!mqttClient.connected() && (mqttReconnectionCounter < mqttMaxReconnections)) {
    mqttReconnectionCounter++;
    mqttClient.connect(mqttClientID, mqttUser, mqttPassword, mqttDisconnectSkip);
    Serial.print("-");
    delay(CONNECTION_RETRY_DELAY);
  }
  if(mqttReconnectionCounter >= mqttMaxReconnections) {
    sprintf(msgString, "\nMQTT Error: MQTT server not connected after <%u> retries", mqttReconnectionCounter);
    Serial.println(msgString);
    
    esp32Restart(ESP32_RESTART_MQTT_CONNECTION);
  }
  Serial.println("\nMQTT server connected.");
  Serial.println();
  
  if((WiFi.status() == WL_CONNECTED) && mqttClient.connected()) {
    connectionsEstablished = 1;
    
    // MQTT subscriptions
    #ifdef DEBUG_OUTPUT
      Serial.println("CTA Aeroheat CI 8is Prod [MQTT Subscriptions]");
    #endif
  }
  
  // reset counters
  wpReconnectionCounter = 0;
  mqttReconnectionCounter = 0;
  wpRegisterBlockIndex = 0;
  
  // start chronos
  wpDataHandleChrono.start();
  refreshOutputStateChrono.start();
  
  #ifdef DEBUG_OUTPUT
    Serial.println();
  #endif
  
  // output wp states 
  outputInfoline();
}  // end setup()

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void loop() {
  // handle SNTP
  if(getLocalTime(&timeInfo)) {
    char timeInfoEpoch[16];
    strftime(timeInfoEpoch, 16, "%s", &timeInfo);
    sntpUnixTimestamp = atoi(timeInfoEpoch);
    
    char timeInfoDST[8];
    strftime(timeInfoDST, 8, "%Z", &timeInfo);
    sntpTimeZone = timeInfoDST;
  }
  
  if(sntpUnixTimestamp > BASE_UNIX_TIMESTAMP) {  // sntp unix timestamp validation
    if(sntpTimeZone == "CET") {
      //sntpTimeZone = "CET";
		  timeZoneAdjustment = GMT_CET;  // Greenwich Mean Time +1 (Central European Winter Time)
	  } else {
      //sntpTimeZone = "CEST";
		  timeZoneAdjustment = GMT_CEST;  // Greenwich Mean Time +2 (Central European Summer Time)
	  }
  }
  
  #ifdef ESP32_RESTART_TIME
  // restart only if ESP32_RESTART_TIME is defined
    if(sntpTimestamp == ESP32_RESTART_TIME) {
      esp32Restart(ESP32_RESTART_SYSTEM);
    }
  #endif
  
  // handle ESP32 Halt
  if(esp32Halt) {
    esp32Halt = false;
    
    Serial.println("ESP32 Halt...");
    #ifdef OTA_OUTPUT
      WebSerial.println("ESP32 Halt...");
    #endif
    
    delay(ESP32_HALT_DELAY);
    esp32Restart(ESP32_RESTART_OTA_HALT);
  }
  
  // handle WebSerial loop
  #ifdef OTA_OUTPUT
    WebSerial.loop();
  #endif
  
  // handle MQTT loop
  mqttClient.loop();
  delay(MQTT_LOOP_DELAY);
  
  // output wp states
  if(refreshOutputStateChrono.hasPassed(STATE_OUTPUT_REFRESH_INTERVAL_CHRONO)) {
    outputInfoline();
    refreshOutputStateChrono.restart();
  }
  
  // handle wp data
  if(wpDataHandleChrono.hasPassed(WP_DATA_HANDLE_INTERVAL_CHRONO) || (wpDataHandleCounter == 0)) {
    wpDataHandleCounter++;
    
    mqttTopicID = "WP";
    
    // MQTT server disconnect
    mqttClient.disconnect();
    delay(CONNECTION_DISCONNECT_DELAY);
    
    // WP server connect
    #ifdef DEBUG_OUTPUT
      sprintf(msgString, "WP server <%s> connecting...", wpServerIP);
      Serial.print(msgString);
    #endif
    #ifdef OTA_OUTPUT
      sprintf(msgString, "WP server <%s> connecting...", wpServerIP);
      WebSerial.print(msgString);
    #endif
    
    while(!wifiConnectionID.connect(wpServerIP, wpServerPort) && (wpReconnectionCounter < wpMaxReconnections)) {
      wpReconnectionCounter++;
      #ifdef DEBUG_OUTPUT
        Serial.print("-");
      #endif
      #ifdef OTA_OUTPUT
        WebSerial.print("-");
      #endif
      
      delay(CONNECTION_RETRY_DELAY);
    }
    if(wpReconnectionCounter >= wpMaxReconnections) {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "\nWP TCP Error: WP server not connected after <%u> retries", wpReconnectionCounter);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "\nWP TCP Error: WP server not connected after <%u> retries", wpReconnectionCounter);
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_WP_TCP_CONNECTION);
    }
    #ifdef DEBUG_OUTPUT
      Serial.println("\nWP server connected.\n");
    #endif
    #ifdef OTA_OUTPUT
      WebSerial.print("\nWP server connected.\n");
    #endif
    
