johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
    // initalize wp communication (transmit tcp commands 'get parameter' + 'execute')
    wifiConnectionID.flush();
    tcpRxBuffer[tcpRxBufferSize] = {0};
    wpCommandTransmitted = 0;
    
    tcpTxCounter = tcpTransmitBuffer(wpTCPCommandGetParameterSequence);  // tcp transmit 'get parameter'
    if(tcpTxCounter == tcpTxPacketSize) {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "WP TCP command 'get parameter' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPCommandGetParameterSequence[0], wpTCPCommandGetParameterSequence[1], wpTCPCommandGetParameterSequence[2], wpTCPCommandGetParameterSequence[3]);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "WP TCP command 'get parameter' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPCommandGetParameterSequence[0], wpTCPCommandGetParameterSequence[1], wpTCPCommandGetParameterSequence[2], wpTCPCommandGetParameterSequence[3]);
        WebSerial.println(msgString);
      #endif
      delay(TCP_TX_DELAY);
    } else {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "WP TCP Error: TCP command 'get parameter' not transmitted!\n");
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "WP TCP Error: TCP command 'get parameter' not transmitted!\n");
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
    }
    tcpTxCounter = tcpTransmitBuffer(wpTCPCommandExecuteSequence);  // tcp transmit 'execute'
    if(tcpTxCounter == tcpTxPacketSize) {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "WP TCP command 'execute' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted\n", wpTCPCommandExecuteSequence[0], wpTCPCommandExecuteSequence[1], wpTCPCommandExecuteSequence[2], wpTCPCommandExecuteSequence[3]);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "WP TCP command 'execute' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted\n", wpTCPCommandExecuteSequence[0], wpTCPCommandExecuteSequence[1], wpTCPCommandExecuteSequence[2], wpTCPCommandExecuteSequence[3]);
        WebSerial.println(msgString);
      #endif
      delay(TCP_TX_DELAY);
    } else {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "WP TCP Error: TCP command 'execute' not transmitted!\n");
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "WP TCP Error: TCP command 'execute' not transmitted!\n");
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
    }
    delay(TCP_COMMUNICATION_DELAY);

    // read all bytes from tcp receive buffer
    tcpRxByteAvailable = wifiConnectionID.available();
    if(tcpRxByteAvailable) {
      tcpRxByteReceived = wifiConnectionID.read(tcpRxBuffer, tcpRxByteAvailable);  // tcp receive data
      delay(TCP_RX_DELAY);
      
      // check received bytes
      if(tcpRxByteReceived == wpRxRequestedByteNumber) {
        #ifdef DEBUG_OUTPUT
          sprintf(msgString, "WP TCP received <%u/%u> bytes", tcpRxByteReceived, wpRxRequestedByteNumber);
          Serial.println(msgString);
        #endif
        #ifdef OTA_OUTPUT
          sprintf(msgString, "WP TCP received <%u/%u> bytes", tcpRxByteReceived, wpRxRequestedByteNumber);
          WebSerial.println(msgString);
        #endif
      } else {
        #ifdef DEBUG_OUTPUT
          sprintf(msgString, "\nWP TCP Error: less than <%u/%u> bytes received!", tcpRxByteReceived, wpRxRequestedByteNumber);
          Serial.println(msgString);
        #endif
        #ifdef OTA_OUTPUT
          sprintf(msgString, "\nWP TCP Error: less than <%u/%u> bytes received!", tcpRxByteReceived, wpRxRequestedByteNumber);
          WebSerial.println(msgString);
        #endif
        
        esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
      }  // end if tcpRxByteReceived
    } else {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "\nWP TCP Error: no data received!");
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "\nWP TCP Error: no data received!");
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
    }  // end if tcpRxByteAvailable
    
    // check received tcp commands
    tcpCheckGetValue = ((tcpRxBuffer[0] << 24) + (tcpRxBuffer[1] << 16) + (tcpRxBuffer[2] << 8) + tcpRxBuffer[3]);  // bytes 0-3
    tcpCheckExecute = ((tcpRxBuffer[4] << 24) + (tcpRxBuffer[5] << 16) + (tcpRxBuffer[6] << 8) + tcpRxBuffer[7]);  // bytes 4-7
    tcpCheckParameters = ((tcpRxBuffer[8] << 24) + (tcpRxBuffer[9] << 16) + (tcpRxBuffer[10] << 8) + tcpRxBuffer[11]);  // bytes 8-11
    
    if((tcpCheckGetValue == wpTCPCommandGetParameter) && (tcpCheckExecute == 0)) {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "WP TCP received valid commands <%lu | %lu | %lu>", tcpCheckGetValue, tcpCheckExecute, tcpCheckParameters);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "WP TCP received valid commands <%lu | %lu | %lu>", tcpCheckGetValue, tcpCheckExecute, tcpCheckParameters);
        WebSerial.println(msgString);
      #endif
      
      wpCommandTransmitted = 1;
    } else {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "\nWP TCP Error: invalid received check commands <%lu | %lu | %lu>!", tcpCheckGetValue, tcpCheckExecute, tcpCheckParameters);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "\nWP TCP Error: invalid received check commands <%lu | %lu | %lu>!", tcpCheckGetValue, tcpCheckExecute, tcpCheckParameters);
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
    }
    #ifdef DEBUG_OUTPUT
      Serial.println();
    #endif
    #ifdef OTA_OUTPUT
      WebSerial.println();
    #endif
    
    // handle adjust wp system time
		if(WP_SYSTEM_TIME_ADJUST) {  // check wp system time adjustment
      wpRegisterBlockName = "AdjustSysTime";
      wpEntityRegisterAddress = wpRegisterBlockSysTime[systenTimeBlockIndex].wpRegisterAddress;
      tcpBufferIndex = (wpEntityRegisterAddress * tcpRxPacketSize);
      
