johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
        WebSerial.println(msgString);
      #endif
      
      if(sntpUnixTimestamp > BASE_UNIX_TIMESTAMP) {  // sntp unix timestamp validation
        // handle wp system time
        wpUnixTimestamp = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
        wpUnixTime.getDateTime(wpUnixTimestamp + (timeZoneAdjustment * 3600));  // convert unix time -> date/time (yyyy-mm-dd hh:mm:ss)
        sprintf(wpDateTime, "%0.4d-%0.2d-%0.2d / %0.2d:%0.2d:%0.2d", wpUnixTime.year, wpUnixTime.month, wpUnixTime.day, wpUnixTime.hour, wpUnixTime.minute, wpUnixTime.second);
        
        wpUnixTimestampDiff = abs(int32_t(sntpUnixTimestamp - wpUnixTimestamp));
			  
        if(wpUnixTimestampDiff > NTP_WP_TIMESTAMP_DIFF) {  // wp system time != ntp time (>= NTP_WP_TIMESTAMP_DIFF)
          // convert ntp unix timestamp to wp parameter value
          wpTCPSetParameterValueSequence[0] = sntpUnixTimestamp >> 24;
          wpTCPSetParameterValueSequence[1] = sntpUnixTimestamp >> 16;
          wpTCPSetParameterValueSequence[2] = sntpUnixTimestamp >> 8;
          wpTCPSetParameterValueSequence[3] = sntpUnixTimestamp;
          
          // initalize wp communication (transmit tcp commands 'set parameter' + 'parameter system time' + 'parameter value'
          wifiConnectionID.flush();
          tcpRxBuffer[tcpRxBufferSize] = {0};
          
          tcpTxCounter = tcpTransmitBuffer(wpTCPCommandSetParameterSequence);  // tcp transmit 'set parameter'
          if(tcpTxCounter == tcpTxPacketSize) {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPCommandSetParameterSequence[0], wpTCPCommandSetParameterSequence[1], wpTCPCommandSetParameterSequence[2], wpTCPCommandSetParameterSequence[3]);
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPCommandSetParameterSequence[0], wpTCPCommandSetParameterSequence[1], wpTCPCommandSetParameterSequence[2], wpTCPCommandSetParameterSequence[3]);
              WebSerial.println(msgString);
            #endif
            delay(TCP_TX_DELAY);
          } else {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP command 'set parameter' not transmitted!\n");
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP command 'set parameter' not transmitted!\n");
              WebSerial.println(msgString);
            #endif
            
            esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
          }
          tcpTxCounter = tcpTransmitBuffer(wpTCPSetParameterSystemTimeSequence);  // tcp transmit 'parameter system time'
          if(tcpTxCounter == tcpTxPacketSize) {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter system time' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPSetParameterSystemTimeSequence[0], wpTCPSetParameterSystemTimeSequence[1], wpTCPSetParameterSystemTimeSequence[2], wpTCPSetParameterSystemTimeSequence[3]);
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter system time' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted", wpTCPSetParameterSystemTimeSequence[0], wpTCPSetParameterSystemTimeSequence[1], wpTCPSetParameterSystemTimeSequence[2], wpTCPSetParameterSystemTimeSequence[3]);
              WebSerial.println(msgString);
            #endif
            delay(TCP_TX_DELAY);
          } else {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP command 'set parameter system time' not transmitted!\n");
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP command 'set parameter system time' not transmitted!\n");
              WebSerial.println(msgString);
            #endif
            
            esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
          }
          tcpTxCounter = tcpTransmitBuffer(wpTCPSetParameterValueSequence);  // tcp transmit 'parameter value' <unix timestamp>
          if(tcpTxCounter == tcpTxPacketSize) {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter value' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted\n", wpTCPSetParameterValueSequence[0], wpTCPSetParameterValueSequence[1], wpTCPSetParameterValueSequence[2], wpTCPSetParameterValueSequence[3]);
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP command 'set parameter value' <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> transmitted\n", wpTCPSetParameterValueSequence[0], wpTCPSetParameterValueSequence[1], wpTCPSetParameterValueSequence[2], wpTCPSetParameterValueSequence[3]);
              WebSerial.println(msgString);
            #endif
          delay(TCP_TX_DELAY);
          } else {
            #ifdef DEBUG_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP command 'set parameter value' not transmitted!\n");
              Serial.println(msgString);
            #endif
            #ifdef OTA_OUTPUT
              sprintf(msgString, "WP TCP Error: TCP TCP command 'set parameter value' not transmitted!\n");
              WebSerial.println(msgString);
            #endif
            
            esp32Restart(ESP32_RESTART_WP_TCP_COMMUNICATION);
          }
          delay(TCP_COMMUNICATION_DELAY);
          
          // read all bytes from tcp receive buffer
          tcpRxByteAvailable = wifiConnectionID.available();
          if(tcpRxByteAvailable) {
            tcpRxByteReceived = wifiConnectionID.read(tcpRxBuffer, tcpRxByteAvailable);  // tcp receive data
            delay(TCP_RX_DELAY);
            
