johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
            sprintf(msgString, "WP TCP received <%lu> bytes", tcpRxByteReceived);
            Serial.println(msgString);
            sprintf(msgString, "bytes[%lu]: <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x> <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x>\n", tcpRxByteReceived, tcpRxBuffer[0], tcpRxBuffer[1], tcpRxBuffer[2], tcpRxBuffer[3], tcpRxBuffer[4], tcpRxBuffer[5], tcpRxBuffer[6], tcpRxBuffer[7]);
            Serial.println(msgString);
          } else {
            sprintf(msgString, "\nWP TCP Error: no data received!");
            Serial.println(msgString);
          }
          
          sprintf(msgString, "sntpUnixTimestamp <%lu> / wpUnixTimestamp <%lu> / wpUnixTimestampDiff <%lu>", sntpUnixTimestamp, wpUnixTimestamp, wpUnixTimestampDiff);
          Serial.println(msgString);
          
          sprintf(msgString, "SNTP Date/Time: <%s>", String(sntpDateTime).c_str());
          Serial.println(msgString);
          
          sprintf(msgString, "WP System Date/Time: <%s>", String(wpDateTime).c_str());
          Serial.println(msgString);
          
          sprintf(msgString, "WP System Date/Time adjust: <%s> / <%lu> / <0x%0.2x 0x%0.2x 0x%0.2x 0x%0.2x>\n", String(sntpDateTime).c_str(), sntpUnixTimestamp, wpTCPSetParameterValueSequence[0], wpTCPSetParameterValueSequence[1], wpTCPSetParameterValueSequence[2], wpTCPSetParameterValueSequence[3]);
          Serial.println(msgString);
        } else {
          sprintf(msgString, "sntpUnixTimestamp <%lu> / wpUnixTimestamp <%lu> / wpUnixTimestampDiff <%lu>", sntpUnixTimestamp, wpUnixTimestamp, wpUnixTimestampDiff);
          Serial.println(msgString);
          
          sprintf(msgString, "SNTP Date/Time: <%s>", String(sntpDateTime).c_str());
          Serial.println(msgString);
          sprintf(msgString, "WP System Date/Time adjust: <%s>", String(wpDateTime).c_str());
          Serial.println(msgString);          
          sprintf(msgString, "WP System Time OK...\n", sntpUnixTimestamp);
          Serial.println(msgString);
        }
      } else {
        sprintf(msgString, "SNTP Unix Timestamp <%lu> not valid!\n", sntpUnixTimestamp);
        Serial.println(msgString);
      }  // sntp unix timestamp validation
		}  // check wp system time adjustment
    
    // WP server disconnect
    wifiConnectionID.stop();
    delay(TCP_DISCONNECT_DELAY);
    
    // MQTT server connect
    #ifdef DEBUG_OUTPUT
      sprintf(msgString, "MQTT server <%s> connecting...", mqttServer);
      Serial.print(msgString);
    #endif
    #ifdef OTA_OUTPUT
      sprintf(msgString, "MQTT server <%s> connecting...", mqttServer);
      WebSerial.print(msgString);
    #endif
    
    mqttClient.begin(mqttServer, mqttServerPort, wifiConnectionID);
    delay(CONNECTION_DELAY);
    mqttReconnectionCounter = 0;
    while(!mqttClient.connected() && (mqttReconnectionCounter < mqttMaxReconnections)) {
      mqttReconnectionCounter++;
      mqttClient.connect(mqttClientID, mqttUser, mqttPassword, mqttDisconnectSkip);
      #ifdef DEBUG_OUTPUT
        Serial.print("-");
      #endif
      #ifdef OTA_OUTPUT
        WebSerial.print("-");
      #endif
      delay(CONNECTION_RETRY_DELAY);
    }
    if(mqttReconnectionCounter >= mqttMaxReconnections) {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "\nMQTT Error: MQTT server not connected after <%u> retries", mqttReconnectionCounter);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "\nMQTT Error: MQTT server not connected after <%u> retries", mqttReconnectionCounter);
        WebSerial.println(msgString);
      #endif
      
      esp32Restart(ESP32_RESTART_MQTT_CONNECTION);
    }
    #ifdef DEBUG_OUTPUT
      Serial.println("\nMQTT server connected.\n");
    #endif
    #ifdef OTA_OUTPUT
      WebSerial.print("\nMQTT server connected.\n");
    #endif
    
    if(wpRegisterBlockIndex == 0) {  // only once per wp register block cycle
      // handle wp system time
      wpRegisterBlockName = "SysTime";
      wpEntityRegisterAddress = wpRegisterBlockSysTime[systenTimeBlockIndex].wpRegisterAddress;
      tcpBufferIndex = (wpEntityRegisterAddress * tcpRxPacketSize);
      
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
        WebSerial.println(msgString);
      #endif
      
      // handle wp system time
      wpUnixTimestamp = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
      wpUnixTime.getDateTime(wpUnixTimestamp + (timeZoneAdjustment * 3600));  // convert unix time -> date/time (yyyy-mm-dd hh:mm:ss)
      sprintf(wpDateTime, "%0.4d-%0.2d-%0.2d / %0.2d:%0.2d:%0.2d", wpUnixTime.year, wpUnixTime.month, wpUnixTime.day, wpUnixTime.hour, wpUnixTime.minute, wpUnixTime.second);
      
      mqttTopicEntity = "System_Time";
      mqttTopic = String(mqttTopicID + "/" + mqttTopicEntity).c_str();
      mqttPayload = ("{\"" + String(mqttTopicEntity) + "\":\"" + String(wpDateTime) + "\"}").c_str();
      mqttSuccess = mqttClient.publish(mqttTopic, mqttPayload, mqttRetained, mqttQoS);
      
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: ", String(mqttTopicEntity).c_str());
        Serial.print(msgString);
        Serial.println(String(wpDateTime).c_str());
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: ", String(mqttTopicEntity).c_str());
        WebSerial.print(msgString);
        WebSerial.println(String(wpDateTime).c_str());
      #endif
    }
    
    // handle wp data
    switch(wpRegisterBlockIndex) {
      case 0: {  // SysValues
        wpRegisterBlockName = "SysValues";
        if(wpRegisterBlocks[wpRegisterBlockIndex].wpRegisterBlockActive) {
          wpRegisterBlockHeadElement = wpRegisterBlocks[wpRegisterBlockIndex].wpRegisterBlockHeadElement;
          wpRegisterBlockElements = wpRegisterBlocks[wpRegisterBlockIndex].wpRegisterBlockElements;
          
          // handle tcp holding register data
          #ifdef DEBUG_OUTPUT
            sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
            Serial.println(msgString);
          #endif
          #ifdef OTA_OUTPUT
            sprintf(msgString, "%s/%s", String(mqttTopicID).c_str(), String(wpRegisterBlockName).c_str());
            WebSerial.println(msgString);
          #endif
          
          for(unsigned short element = 0; element < wpRegisterBlockElements; element++) {
            wpEntityRegisterAddress = wpRegisterSysValues[element].wpRegisterAddress;
            wpEntityDescriptor = wpRegisterSysValues[element].wpRegisterDescriptor;
            wpEntityDataType = wpRegisterSysValues[element].wpRegisterDataType;
            wpEntityDataFactor = wpRegisterSysValues[element].wpRegisterDataFactor;
            wpEntityUnit = wpRegisterSysValues[element].wpRegisterUnit;
            wpEntityActiveMQTT = wpRegisterSysValues[element].wpRegisterActiveMQTT;
            
            tcpBufferIndex = (wpEntityRegisterAddress * tcpRxPacketSize);  // (wpEntity...Address * 4), ((wpEntity...Address + 1) * 4), ((wpEntity...Address + 1) * 4), ..., (wpRegisterBlockElements * 4)
            
            if(wpEntityRegisterAddress == WP_REGISTER_VALUES_STATE_WP) {  // special case value wp state
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
              wpStateID = wpValueU32;  // global wp state ID
              wpState = wpRegisterSysValuesState[wpStateID].wpRegisterStateDescriptor;  // global wp state
            }
            
            if(wpEntityRegisterAddress == WP_REGISTER_VALUES_SHUTDOWN_REASON0) {  // special cases value shutdown reason
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
