johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
              wpShutdownReasonID = (wpValueU32 - 1);
              wpShutdownReason[0] = wpRegisterSysValuesShutdownReason[wpShutdownReasonID].wpRegisterShutdownReasonDescriptor;  // global wp shutdown reason 0
            } else if(wpEntityRegisterAddress == WP_REGISTER_VALUES_SHUTDOWN_REASON1) {
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
              wpShutdownReasonID = (wpValueU32 - 1);
              wpShutdownReason[1] = wpRegisterSysValuesShutdownReason[wpShutdownReasonID].wpRegisterShutdownReasonDescriptor;  // global wp shutdown reason 0
            } else if(wpEntityRegisterAddress == WP_REGISTER_VALUES_SHUTDOWN_REASON2) {
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
              wpShutdownReasonID = (wpValueU32 - 1);
              wpShutdownReason[2] = wpRegisterSysValuesShutdownReason[wpShutdownReasonID].wpRegisterShutdownReasonDescriptor;  // global wp shutdown reason 0
            } else if(wpEntityRegisterAddress == WP_REGISTER_VALUES_SHUTDOWN_REASON3) {
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
              wpShutdownReasonID = (wpValueU32 - 1);
              wpShutdownReason[3] = wpRegisterSysValuesShutdownReason[wpShutdownReasonID].wpRegisterShutdownReasonDescriptor;  // global wp shutdown reason 0
            } else if(wpEntityRegisterAddress == WP_REGISTER_VALUES_SHUTDOWN_REASON4) {
              uint32_t wpValueU32 = ((tcpRxBuffer[tcpBufferIndex + 0] << 24) + (tcpRxBuffer[tcpBufferIndex + 1] << 16) + (tcpRxBuffer[tcpBufferIndex + 2] << 8) + tcpRxBuffer[tcpBufferIndex + 3]);
              
              wpShutdownReasonID = (wpValueU32 - 1);
              wpShutdownReason[4] = wpRegisterSysValuesShutdownReason[wpShutdownReasonID].wpRegisterShutdownReasonDescriptor;  // global wp shutdown reason 0
            }
            
            outputWPData(tcpRxBuffer, tcpBufferIndex, wpEntityDescriptor, wpEntityDataType, wpEntityDataFactor, wpEntityUnit, wpEntityActiveMQTT, mqttRetained, mqttQoS);
            
            if((element % WEB_SERIAL_MAX_OUTPUT_COUNT) == 0) {  // check web serial output sequence count
              delay(WEB_SERIAL_MAX_OUTPUT_DELAY);
            }
          }
          wpDataHandleChrono.restart();  // restart chrono
          
          #ifdef DEBUG_OUTPUT
            Serial.println();
          #endif
          #ifdef OTA_OUTPUT
            WebSerial.println();
          #endif
        }  // end if wpRegisterBlockActive
        wpRegisterBlockIndex = 0;  // only one wp register block
        break;
      }  // end case
      default: {
        wpRegisterBlockIndex = 0;  // reset wp register block index
        break;
      }  // end default
    }  // end switch wpRegisterBlockIndex
  }  // end if wpDataHandleChrono.hasPassed
}  // end loop()

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void esp32Restart(uint8_t esp32RestartID) {
  String mqttTopicID = "ESP32";
  String mqttTopicEntity = "Restart";
  String mqttPayload="1";
  bool mqttSuccess;
  
  // adjust+store NVS ESP32 restart counters
  esp32RestartInfo[esp32RestartID].esp32RestartCounter++;
  nvs.putUInt(esp32RestartInfo[esp32RestartID].esp32RestartReasonNVS, esp32RestartInfo[esp32RestartID].esp32RestartCounter);
  
  sprintf(msgString, "ESP32 Restarting [%s]...", esp32RestartInfo[esp32RestartID].esp32RestartReason);
  Serial.println(msgString);
  
  #ifdef OTA_OUTPUT
    sprintf(msgString, "ESP32 Restarting [%s]...", esp32RestartInfo[esp32RestartID].esp32RestartReason);
    WebSerial.println(msgString);
  #endif
  
  // MQTT publish
  mqttTopic = String(mqttTopicID + "/" + mqttTopicEntity).c_str();
  mqttPayload = ("{\"" + String(mqttTopicEntity) + "\":\"" + String(mqttPayload) + "\"}").c_str();
  mqttSuccess = mqttClient.publish(mqttTopic, mqttPayload, mqttRetained, mqttQoS);
  delay(MQTT_PUBLISH_DELAY);
  
  // reset connections
  mqttClient.disconnect();
  delay(CONNECTION_DELAY);
  esp_sntp_stop();
  delay(CONNECTION_DELAY);
  wifiConnectionID.stop();
  delay(CONNECTION_DELAY);
  WiFi.disconnect();
  
  // NVS end
  nvs.end();
  
  delay(ESP32_RESTART_DELAY);
  ESP.restart();
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void serialOTAReceiver(uint8_t *data, size_t length) {
  String buffer = "";
  
  for(uint8_t i = 0; i < length; i++) {
    buffer += char(data[i]);
  }
  
  if(buffer == "Restart") {
    esp32Restart(ESP32_RESTART_OTA_RESTART);
  } else if(buffer == "Halt") {
    esp32Halt = 1;
  } else if(buffer == "Clear") {
    // clear NVS
    nvs.clear();
    
    // read NVS values
    for(uint8_t i = 0; i < ESP32_RESTART_INFO_ELEMENTS; i++) {
      esp32RestartInfo[i].esp32RestartCounter = nvs.getUInt(esp32RestartInfo[i].esp32RestartReasonNVS);
    }
    
    WebSerial.println("ESP32: NVS cleared.");
  } else {
    WebSerial.println("Usage: \'Restart\' | \'Halt\' | \'Clear\'");
  }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
unsigned int tcpTransmitBuffer(uint8_t *tcpTxBuffer) {
  unsigned int tcpTxBytes = 0;

  tcpTxBytes = wifiConnectionID.write(tcpTxBuffer, sizeof(tcpTxBuffer));
  
  return(tcpTxBytes);
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void outputInfoline() {
  #ifdef DEBUG_OUTPUT
    sprintf(msgString, "WP CTA Aeroheat CI 8is Prod [%s] - %s (%s)", String(wpState).c_str(), String(wpDateTime).c_str(), sntpTimeZone);
    Serial.println(msgString);
    
    sprintf(msgString, "ESP32 Restart Counters: [%lu | %lu | %lu | %lu | %lu | %lu | %lu] - [%s | %s | %s | %s | %s | %s | %s]", \
                                                 esp32RestartInfo[0].esp32RestartCounter, esp32RestartInfo[1].esp32RestartCounter, esp32RestartInfo[2].esp32RestartCounter, esp32RestartInfo[3].esp32RestartCounter, esp32RestartInfo[4].esp32RestartCounter, esp32RestartInfo[5].esp32RestartCounter, esp32RestartInfo[6].esp32RestartCounter, \
                                                 esp32RestartInfo[0].esp32RestartReasonNVS, esp32RestartInfo[1].esp32RestartReasonNVS, esp32RestartInfo[2].esp32RestartReasonNVS, esp32RestartInfo[3].esp32RestartReasonNVS, esp32RestartInfo[4].esp32RestartReasonNVS, esp32RestartInfo[5].esp32RestartReasonNVS, esp32RestartInfo[6].esp32RestartReasonNVS);
    Serial.println(msgString);
    
    Serial.println();
  #endif
  
  #ifdef OTA_OUTPUT
    sprintf(msgString, "WP CTA Aeroheat CI 8is Prod [%s] - %s (%s)", String(wpState).c_str(), String(wpDateTime).c_str(), sntpTimeZone);
    WebSerial.println(msgString);
    
    sprintf(msgString, "ESP32 Restart Counters: [%lu | %lu | %lu | %lu | %lu | %lu | %lu] - [%s | %s | %s | %s | %s | %s | %s]", \
                                                 esp32RestartInfo[0].esp32RestartCounter, esp32RestartInfo[1].esp32RestartCounter, esp32RestartInfo[2].esp32RestartCounter, esp32RestartInfo[3].esp32RestartCounter, esp32RestartInfo[4].esp32RestartCounter, esp32RestartInfo[5].esp32RestartCounter, esp32RestartInfo[6].esp32RestartCounter, \
                                                 esp32RestartInfo[0].esp32RestartReasonNVS, esp32RestartInfo[1].esp32RestartReasonNVS, esp32RestartInfo[2].esp32RestartReasonNVS, esp32RestartInfo[3].esp32RestartReasonNVS, esp32RestartInfo[4].esp32RestartReasonNVS, esp32RestartInfo[5].esp32RestartReasonNVS, esp32RestartInfo[6].esp32RestartReasonNVS);
    WebSerial.println(msgString);
    
