johann-CH/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT_HA_Integration/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT/ESP32_WP_CTA_Aeroheat_CI_8is_MQTT.cpp
    WebSerial.println();
  #endif
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void outputWPData(uint8_t *tcpBuffer, uint16_t tcpBufferIndex, char *wpEntityDescriptor, char *wpEntityDataType, float wpEntityDataFactor, char *wpEntityUnit, bool mqttActive, bool mqttRetained, uint16_t mqttQoS) {
  String mqttTopicID = "WP";
  UnixTime unixTime(GMT);
  bool mqttSuccess;
  
  if((wpEntityDataType == "U32") || (wpEntityDataType == "Status") || (wpEntityDataType == "I/O")) {
    uint32_t bufferValueUInt32 = ((tcpBuffer[tcpBufferIndex + 0] << 24) + (tcpBuffer[tcpBufferIndex + 1] << 16) + (tcpBuffer[tcpBufferIndex + 2] << 8) + tcpBuffer[tcpBufferIndex + 3]);
    
    if(wpEntityDescriptor == "Abschalt_Ursache0") {  
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[0]).c_str(), bufferValueUInt32);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[0]).c_str(), bufferValueUInt32);
        WebSerial.println(msgString);
      #endif
      
      sprintf(msgString, "%s[%u]", String(wpShutdownReason[0]).c_str(), bufferValueUInt32);
      if(mqttActive) {
        mqttSuccess = mqttPublishTopicPayloadString(mqttTopicID, wpEntityDescriptor, msgString, mqttRetained, mqttQoS);
      }
    } else if(wpEntityDescriptor == "Abschalt_Ursache1") {  
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[1]).c_str(), bufferValueUInt32);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[1]).c_str(), bufferValueUInt32);
        WebSerial.println(msgString);
      #endif
    } else if(wpEntityDescriptor == "Abschalt_Ursache2") {  
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[2]).c_str(), bufferValueUInt32);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[2]).c_str(), bufferValueUInt32);
        WebSerial.println(msgString);
      #endif
    } else if(wpEntityDescriptor == "Abschalt_Ursache3") {  
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[3]).c_str(), bufferValueUInt32);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[3]).c_str(), bufferValueUInt32);
        WebSerial.println(msgString);
      #endif
    } else if(wpEntityDescriptor == "Abschalt_Ursache4") {  
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[4]).c_str(), bufferValueUInt32);
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %s[%u]", String(wpEntityDescriptor).c_str(), String(wpShutdownReason[4]).c_str(), bufferValueUInt32);
        WebSerial.println(msgString);
      #endif
    } else {
      #ifdef DEBUG_OUTPUT
        sprintf(msgString, "%s: %u%s", String(wpEntityDescriptor).c_str(), bufferValueUInt32, String(wpEntityUnit).c_str());
        Serial.println(msgString);
      #endif
      #ifdef OTA_OUTPUT
        sprintf(msgString, "%s: %u%s", String(wpEntityDescriptor).c_str(), bufferValueUInt32, String(wpEntityUnit).c_str());
        WebSerial.println(msgString);
      #endif
    }
    
    if(mqttActive) {
      mqttSuccess = mqttPublishTopicPayloadUInt32(mqttTopicID, wpEntityDescriptor, bufferValueUInt32, mqttRetained, mqttQoS);
    }
  } else if(wpEntityDataType == "F32") {
    // float convertion method #1
    float bufferValueFloat32 = (((tcpBuffer[tcpBufferIndex + 0] << 24) + (tcpBuffer[tcpBufferIndex + 1] << 16) + (tcpBuffer[tcpBufferIndex + 2] << 8) + tcpBuffer[tcpBufferIndex + 3]) * wpEntityDataFactor);
    
    #ifdef DEBUG_OUTPUT
      sprintf(msgString, "%s: %0.2f%s", String(wpEntityDescriptor).c_str(), bufferValueFloat32, String(wpEntityUnit).c_str());
      Serial.println(msgString);
    #endif
    #ifdef OTA_OUTPUT
      sprintf(msgString, "%s: %0.2f%s", String(wpEntityDescriptor).c_str(), bufferValueFloat32, String(wpEntityUnit).c_str());
      WebSerial.println(msgString);
    #endif
    
    if(mqttActive) {
      mqttSuccess = mqttPublishTopicPayloadFloat32(mqttTopicID, wpEntityDescriptor, bufferValueFloat32, mqttRetained, mqttQoS);
    }
  } else if(wpEntityDataType == "UX") {
    uint32_t bufferValueUInt32 = ((tcpBuffer[tcpBufferIndex + 0] << 24) + (tcpBuffer[tcpBufferIndex + 1] << 16) + (tcpBuffer[tcpBufferIndex + 2] << 8) + tcpBuffer[tcpBufferIndex + 3]);
    
    // convert unix timestamp
    unixTime.getDateTime(bufferValueUInt32 + (timeZoneAdjustment * 3600));  // convert unix time -> date/time (yyyy-mm-dd hh:mm:ss)
    
    #ifdef DEBUG_OUTPUT
      sprintf(msgString, "%s: %0.4d-%0.2d-%0.2d / %0.2d:%0.2d:%0.2d", String(wpEntityDescriptor).c_str(), unixTime.year, unixTime.month, unixTime.day, unixTime.hour, unixTime.minute, unixTime.second);
      Serial.println(msgString);
    #endif
    #ifdef OTA_OUTPUT
      sprintf(msgString, "%s: %0.4d-%0.2d-%0.2d / %0.2d:%0.2d:%0.2d", String(wpEntityDescriptor).c_str(), unixTime.year, unixTime.month, unixTime.day, unixTime.hour, unixTime.minute, unixTime.second);
      WebSerial.println(msgString);
    #endif
    
    if(mqttActive) {
      sprintf(msgString, "%0.4d-%0.2d-%0.2d / %0.2d:%0.2d:%0.2d", unixTime.year, unixTime.month, unixTime.day, unixTime.hour, unixTime.minute, unixTime.second);
      mqttSuccess = mqttPublishTopicPayloadString(mqttTopicID, wpEntityDescriptor, msgString, mqttRetained, mqttQoS);
    }
  } else if(wpEntityDataType == "IP") {
    #ifdef DEBUG_OUTPUT
      sprintf(msgString, "%s: %u.%u.%u.%u", String(wpEntityDescriptor).c_str(), tcpBuffer[tcpBufferIndex + 0], tcpBuffer[tcpBufferIndex + 1], tcpBuffer[tcpBufferIndex + 2], tcpBuffer[tcpBufferIndex + 3]);
      Serial.println(msgString);
    #endif
    #ifdef OTA_OUTPUT
      sprintf(msgString, "%s: %u.%u.%u.%u", String(wpEntityDescriptor).c_str(), tcpBuffer[tcpBufferIndex + 0], tcpBuffer[tcpBufferIndex + 1], tcpBuffer[tcpBufferIndex + 2], tcpBuffer[tcpBufferIndex + 3]);
      WebSerial.println(msgString);
    #endif
    
    if(mqttActive) {
      sprintf(msgString, "%u.%u.%u.%u", tcpBuffer[tcpBufferIndex + 0], tcpBuffer[tcpBufferIndex + 1], tcpBuffer[tcpBufferIndex + 2], tcpBuffer[tcpBufferIndex + 3]);
      mqttSuccess = mqttPublishTopicPayloadString(mqttTopicID, wpEntityDescriptor, msgString, mqttRetained, mqttQoS);
    }
  } else {
    #ifdef DEBUG_OUTPUT
      Serial.print("Unknown Type: ");
      Serial.println(wpEntityDataType);
    #endif
    #ifdef OTA_OUTPUT
      WebSerial.print("Unknown Type: ");
      WebSerial.println(wpEntityDataType);
    #endif
  }
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
bool mqttPublishTopicPayloadString(String mqttTopicID, String mqttTopicEntity, String mqttPayloadString, bool mqttRetained, uint16_t mqttQoS) {
  String mqttTopic;
  String mqttPayload;
  bool mqttSuccess;
  
  mqttTopic = String(mqttTopicID + "/" + mqttTopicEntity).c_str();
  mqttPayload = ("{\"" + String(mqttTopicEntity) + "\":\"" + String(mqttPayloadString) + "\"}").c_str();
  mqttSuccess = mqttClient.publish(mqttTopic, mqttPayload, mqttRetained, mqttQoS);
  delay(MQTT_PUBLISH_DELAY);
  return(mqttSuccess);
}

bool mqttPublishTopicPayloadUInt32(String mqttTopicID, String mqttTopicEntity, uint32_t mqttPayloadUInt32, bool mqttRetained, uint16_t mqttQoS) {
  String mqttTopic;
  String mqttPayload;
  bool mqttSuccess;
  
  mqttTopic = String(mqttTopicID + "/" + mqttTopicEntity).c_str();
  mqttPayload = ("{\"" + String(mqttTopicEntity) + "\":\"" + String(mqttPayloadUInt32) + "\"}").c_str();
  mqttSuccess = mqttClient.publish(mqttTopic, mqttPayload, mqttRetained, mqttQoS);
  delay(MQTT_PUBLISH_DELAY);
  return(mqttSuccess);
}

bool mqttPublishTopicPayloadFloat32(String mqttTopicID, String mqttTopicEntity, float mqttPayloadFloat32, bool mqttRetained, uint16_t mqttQoS) {
  String mqttTopic;
  String mqttPayload;
  bool mqttSuccess;

  mqttTopic = String(mqttTopicID + "/" + mqttTopicEntity).c_str();
  mqttPayload = ("{\"" + String(mqttTopicEntity) + "\":\"" + String(mqttPayloadFloat32, 2) + "\"}").c_str();
  mqttSuccess = mqttClient.publish(mqttTopic, mqttPayload, mqttRetained, mqttQoS);
  delay(MQTT_PUBLISH_DELAY);
  return(mqttSuccess);
}

//EOF